import aboutSlider1 from './images/about-slider.png';

export const QuestionsAnswersData = [
    {
        question: 'На него нужны права категории M?',
        answer: 'Продуманный угол рассеивания света позволяет сохранять хорошую видимость, не ослепляя  других участников движения.',
    },
    {
        question: 'У меня вес 135 кг, выдержит ли этот самокат?',
        answer: 'Самокат определенно выдержит и будет ехать, но не с максимальной скоростью.',
    },
    {
        question: 'Есть ли влагозащита?',
        answer: 'Электросамокат имеет степень защиты IP54. Он защищен от попадания пыли и брызг, падающих  в любом направлении. Погружение в воду может привести к поломке. ',
    },
    {
        question: 'Это версия для Китая или Европы?',
        answer: 'Это Европейская версия, со всеми обновлениями и евро-вилкой.',
    },
];

export const ReviewsData = [
    {
        name: 'Михаил Сафонов',
        text: 'Выбирал между двумя моделями: этим Mi Scooter Pro 2  и Ninebot Max 30P, в плюсах Макса - десятидюймовая резина и дальность пробега на одном заряде, скорость зарядки. В плюсах Xiaomi - Удобства переноски (вес аппарата, развесовка). В итоге купил Xiaomi и поставил 10 дюймовые шины - получил комфорт при небольшом весе самоката.',
    },
    {
        name: '',
        text: 'Владею также первой версией самоката (m365).  В версии pro 2 исправлено множество недостатков m365:\n' +
            '- усилен узел складывания и язычок\n' +
            ' - батарея находится в отдельном жёстком алюминиевом корпусе, что исключает её поломку из-за тряски\n' +
            ' - установлена поддержка заднего крыла и защита провода заднего габарита.',
    },
    {
        name: 'Алексей З.',
        text: 'Мой вес 57кг, прошитый с максимальной 32км в час в режиме S по Москве у меня осилил - 25км и еще оставалось 16% заряда.\n' +
            'ОБЯЗАТЕЛЬНО: следите за давлением в камерах. Прям очень советую купить электронный насос от Xiaomi, и раз в неделю подкачивайте. С завода самокат приезжает с сильно недокачанными',
    },
];

export const ScooterSetData = [
    'Адаптер питания',
    'Шестигранный ключ',
    'Удлинитель для насоса',
    'Винты x 5 шт.',
    'Запасная шина',
    'Руководство пользователя',
    'Буклет с информацией',
];

export const ScooterBatteryData = [
    {
        title: 'Три режима скорости',
        text: 'Три режима езды позволяют почуствовать себя комфортно в любой ситуации. Режим «S» увеличитвает скорость, если опаздываете на работу.  Во время прогулки по парку активируйте режим «D».  Включите режим «Пешеход», когда двигаетесь  по оживлённой улице.'
    },
    {
        title: 'Система восстановления энергии',
        text: 'Во время торможения и движения по инерции система преобразовывает кинетическую энергию  в электрическую, позволяя увеличить общий  запас хода самоката.'
    },
    {
        title: 'Мощная батарея',
        text: 'Самокат оснащен аккумулятором емкостью  12 800 мАч. Это позволяет преодолевать расстояния  до 45 км без подзарядки.'
    }
];

export const ScooterDesignData = [
    {
        title: 'Минималистичный дизайн',
        text: 'Рама, компоненты и аксессуары скутера выдержаны в едином стиле, где удобство пользователя выходит на первое место.  Одного прикосновения достаточно, чтобы запустить самокат.'
    },
    {
        title: 'Удобная панель управления',
        text: 'Удобно расположенные элементы управления. Отображение 8 типов данных в реальном времени: скорость, режим, заряд аккумулятора, состояние блокировки и другая информация.'
    }
];

export const ScooterSafetyData = [
    {
        title: 'Яркие ходовые  огни',
        text: 'Продуманный угол рассеивания света позволяет сохранять хорошую видимость, не ослепляя других участников движения.'
    },
    {
        title: 'Двойная тормозная система',
        text: 'При нажатии наручку тормоза системы переднего и заднего колеса активируются последовательно, сокращая тормозной путь  и обеспечивая безопасную и плавную остановку.'
    },
    {
        title: 'Яркая задняя  фара',
        text: 'При включении ходовых огней задняя фара включается автоматически.  При нажатии на ручку тормоза она начинает мигать, предупреждая других участников движения.\n'
    },
    {
        title: 'Отражатели спереди, сбоку и сзади',
        text: 'Улучшенные отражатели, размещенные с четырех сторон, делают вашу поездку  в темное время суток безопаснее.'
    },
];

export const ScooterAboutSliderData = [
    {
        image: aboutSlider1,
        title: 'О бренде Xiaomi',
        text: 'Компания Xiaomi была основана предпринимателем Лей Цзюнем в 2010 году под девизом - «Инновации для всех».\n' +
            'Мы верим, что высококачественные продукты и передовые технологии должны быть доступны каждому.\n'
    },
    {
        image: aboutSlider1,
        title: 'О бренде Xiaomi',
        text: 'Компания Xiaomi была основана предпринимателем Лей Цзюнем  в 2010 году под девизом - «Инновации для всех».\n' +
            'Мы верим, что высококачественные продукты и передовые технологии должны быть доступны каждому.\n'
    },
    {
        image: aboutSlider1,
        title: 'О бренде Xiaomi',
        text: 'Компания Xiaomi была основана предпринимателем Лей Цзюнем в 2010 году под девизом - «Инновации для всех».\n' +
            'Мы верим, что высококачественные продукты и передовые технологии должны быть доступны каждому.\n'
    },
];